out.xml

<SOAP-ENV:Envelope xmlns:SOAP-ENV="http://schemas.xmlsoap.org/soap/envelope/"
                   xmlns:ns1="http://schemas.cisco.com/ast/soap" xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance">
    <SOAP-ENV:Body>
        <ns1:selectCmDeviceExt>
            <ns1:StateInfo></ns1:StateInfo>
            <ns1:CmSelectionCriteria>
                <ns1:MaxReturnedDevices>1000</ns1:MaxReturnedDevices>
                <ns1:DeviceClass>Phone</ns1:DeviceClass>
                <ns1:Model>255</ns1:Model>
                <ns1:Status>Any</ns1:Status>
                <ns1:NodeName></ns1:NodeName>
                <ns1:SelectBy>Name</ns1:SelectBy>
                <ns1:SelectItems>
                    <ns1:item>
                        <ns1:Item>SEP009E1EAD79DE</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>SEP40A6E8B10350</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>SEP44D3CA71F02E</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>SEP0026CBBEAF4D</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>SEP0004F2813484</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>SEP009E1EAD7B36</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>SEP1C6A7AE0F78D</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>CSFMarty</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>TCTMARTY</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>CSFKC</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>TCTKC</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>TABKC</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>SEPF0B2E58EF7A3</ns1:Item>
                    </ns1:item>
                    <ns1:item>
                        <ns1:Item>SEP5006AB802350</ns1:Item>
                    </ns1:item>
                </ns1:SelectItems>
                <ns1:Protocol xsi:nil="true"/>
                <ns1:DownloadStatus xsi:nil="true"/>
            </ns1:CmSelectionCriteria>
        </ns1:selectCmDeviceExt>
    </SOAP-ENV:Body>
</SOAP-ENV:Envelope>
